Revit 2027 API
Stone.StoneBumpAmount Property
 The property labeled "Amount" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StoneBumpAmount { get; }
Public Shared ReadOnly Property StoneBumpAmount As String
	Get
public:
static property String^ StoneBumpAmount {
	String^ get ();
}
static member StoneBumpAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace